In [1]:
import pandas as pd
import numpy as np

**CSV파일 불러오기**

In [3]:
df = pd.read_csv('./data.csv', encoding='euc-kr')

**살펴보기**

In [4]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
df.tail()

     지역명               규모구분    연도  월 분양가격(㎡)
4585  제주                 전체  2020  3    3955
4586  제주         전용면적 60㎡이하  2020  3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4589  제주        전용면적 102㎡초과  2020  3    3601

**COLUMN 이름 바꾸기**

In [ ]:
df=df.rename(columns={'분양가격(㎡)':'분양가'})
df.head()

  지역명               규모구분    연도   월   분양가
0  서울                 전체  2015  10  5841
1  서울         전용면적 60㎡이하  2015  10  5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721
4  서울        전용면적 102㎡초과  2015  10  5879

**Data Type 보기**

In [ ]:
df.dtypes

지역명     object
규모구분    object
연도       int64
월        int64
분양가     object
dtype: object

In [ ]:
df['분양가'] = df['분양가'].apply(pd.to_numeric, errors = 'coerce')
df.dtypes
df.head()

  지역명               규모구분    연도   월     분양가
0  서울                 전체  2015  10  5841.0
1  서울         전용면적 60㎡이하  2015  10  5652.0
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0
4  서울        전용면적 102㎡초과  2015  10  5879.0

**Numpy array로 변환**

In [ ]:
arr = df.to_numpy()
arr

array([['서울', '전체', 2015, 10, 5841.0],
       ['서울', '전용면적 60㎡이하', 2015, 10, 5652.0],
       ['서울', '전용면적 60㎡초과 85㎡이하', 2015, 10, 5882.0],
       ...,
       ['제주', '전용면적 60㎡초과 85㎡이하', 2020, 3, 3962.0],
       ['제주', '전용면적 85㎡초과 102㎡이하', 2020, 3, nan],
       ['제주', '전용면적 102㎡초과', 2020, 3, 3601.0]], dtype=object)

In [ ]:
len(arr)

4590

In [ ]:
print(arr[0], arr[1])

['서울' '전체' 2015 10 5841.0] ['서울' '전용면적 60㎡이하' 2015 10 5652.0]

In [ ]:
print(arr[0][0])

서울

**간단한 통계**

In [ ]:
df.describe()

                연도            월           분양가
count  4590.000000  4590.000000   4260.000000
mean   2017.500000     6.500000   3270.160798
std       1.343856     3.594368   1300.362742
min    2015.000000     1.000000   1868.000000
25%    2016.000000     3.000000   2454.750000
50%    2017.500000     6.500000   2890.000000
75%    2019.000000    10.000000   3601.000000
max    2020.000000    12.000000  13835.000000

**축 변환하기**

In [ ]:
df.T.head()

      0           1     ...               4588         4589
지역명     서울          서울  ...                 제주           제주
규모구분    전체  전용면적 60㎡이하  ...  전용면적 85㎡초과 102㎡이하  전용면적 102㎡초과
연도    2015        2015  ...               2020         2020
월       10          10  ...                  3            3
분양가   5841        5652  ...                NaN         3601

[5 rows x 4590 columns]

**Index 정렬**

In [ ]:
#내림차순
a = df.sort_index(axis=0, ascending=False)
a.head()

     지역명               규모구분    연도  월     분양가
4589  제주        전용면적 102㎡초과  2020  3  3601.0
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3  3962.0
4586  제주         전용면적 60㎡이하  2020  3  4039.0
4585  제주                 전체  2020  3  3955.0

In [ ]:
#오름차순
b = df.sort_index(axis=0, ascending=True)
b.head()

  지역명               규모구분    연도   월     분양가
0  서울                 전체  2015  10  5841.0
1  서울         전용면적 60㎡이하  2015  10  5652.0
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0
4  서울        전용면적 102㎡초과  2015  10  5879.0

**Value 정렬**

In [ ]:
df.sort_values(by='분양가', ascending=False)

     지역명               규모구분    연도   월      분양가
4508  서울  전용면적 85㎡초과 102㎡이하  2020   3  13835.0
4423  서울  전용면적 85㎡초과 102㎡이하  2020   2  13835.0
4253  서울  전용면적 85㎡초과 102㎡이하  2019  12  12728.0
3998  서울  전용면적 85㎡초과 102㎡이하  2019   9  12728.0
4083  서울  전용면적 85㎡초과 102㎡이하  2019  10  12728.0
...   ..                ...   ...  ..      ...
4546  세종         전용면적 60㎡이하  2020   3      NaN
4553  강원  전용면적 85㎡초과 102㎡이하  2020   3      NaN
4578  경북  전용면적 85㎡초과 102㎡이하  2020   3      NaN
4584  경남        전용면적 102㎡초과  2020   3      NaN
4588  제주  전용면적 85㎡초과 102㎡이하  2020   3      NaN

[4590 rows x 5 columns]

**Label로 선택**

In [ ]:
df.loc[:, ['지역명', '연도']][:7]

  지역명    연도
0  서울  2015
1  서울  2015
2  서울  2015
3  서울  2015
4  서울  2015
5  인천  2015
6  인천  2015

In [ ]:
df.loc[:6 ,['지역명', '연도']]

  지역명    연도
0  서울  2015
1  서울  2015
2  서울  2015
3  서울  2015
4  서울  2015
5  인천  2015
6  인천  2015

In [ ]:
df.loc[df.index > 5, ['지역명', '연도']][:10]

   지역명    연도
6   인천  2015
7   인천  2015
8   인천  2015
9   인천  2015
10  경기  2015
11  경기  2015
12  경기  2015
13  경기  2015
14  경기  2015
15  부산  2015

In [ ]:
df.loc[(df['지역명']=='인천') & (df['연도']==2018),['지역명', '연도', '분양가']].sort_values(by='분양가', ascending=False)[:10]

     지역명    연도     분양가
2644  인천  2018  4835.0
2389  인천  2018  4835.0
2559  인천  2018  4835.0
2304  인천  2018  4835.0
2474  인천  2018  4835.0
3154  인천  2018  4455.0
3239  인천  2018  4455.0
2471  인천  2018  3754.0
2556  인천  2018  3754.0
3237  인천  2018  3731.0

In [5]:
df.iloc[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [6]:
# df.iloc과 동작방식은 동일하지만, 범위 지정은 불가
df.iat[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [7]:
df.iloc[2, :]

지역명                      서울
규모구분       전용면적 60㎡초과 85㎡이하
연도                     2015
월                        10
분양가격(㎡)                5882
Name: 2, dtype: object

In [8]:
# iloc으로 인덱스 지정시 : 기준으로 왼쪽은 포함, : 기준으로 오른쪽은 미만
df.iloc[:5, 1:3]

                규모구분    연도
0                 전체  2015
1         전용면적 60㎡이하  2015
2   전용면적 60㎡초과 85㎡이하  2015
3  전용면적 85㎡초과 102㎡이하  2015
4        전용면적 102㎡초과  2015

In [9]:
df[df.연도 == 2019][:5]

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

In [10]:
copy = df.copy()
copy.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [11]:
# 지역명 == 서울 인 지역만 선택
df.loc[df['지역명']=='서울','지역명'][:10]

0     서울
1     서울
2     서울
3     서울
4     서울
85    서울
86    서울
87    서울
88    서울
89    서울
Name: 지역명, dtype: object

In [13]:
# 지역명 == 서울 인 지역을 Seoul로 변경(값을 set)
df.loc[df['지역명']=='서울','지역명'] = 'Seoul'
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [14]:
df1 = df.reindex(index=df.index[:7], columns=list(df.columns) + ['extra'])
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [15]:
df1.loc[:4, 'extra'] = False
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [16]:
df2 = df1.copy()
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [17]:
df2.dropna(how='any')

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [18]:
#원본 데이터에 반영
df2.dropna(how='any', inplace=True)
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [19]:
df2 = df1.copy()
df2.fillna(value=True)

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163   True
6     인천         전용면적 60㎡이하  2015  10    3488   True

In [20]:
pd.isna(df2)

     지역명   규모구분     연도      월  분양가격(㎡)  extra
0  False  False  False  False    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False
5  False  False  False  False    False   True
6  False  False  False  False    False   True

In [21]:
df.mean() #df.mean(0)

연도    2017.5
월        6.5
dtype: float64

In [22]:
df.mean(1)[:5]

0    1012.5
1    1012.5
2    1012.5
3    1012.5
4    1012.5
dtype: float64

In [23]:
df.shift(2)[:5]

     지역명              규모구분      연도     월 분양가격(㎡)
0    NaN               NaN     NaN   NaN     NaN
1    NaN               NaN     NaN   NaN     NaN
2  Seoul                전체  2015.0  10.0    5841
3  Seoul        전용면적 60㎡이하  2015.0  10.0    5652
4  Seoul  전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882

In [24]:
df.shift(-2)[:5]

     지역명               규모구분      연도     월 분양가격(㎡)
0  Seoul   전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882
1  Seoul  전용면적 85㎡초과 102㎡이하  2015.0  10.0    5721
2  Seoul        전용면적 102㎡초과  2015.0  10.0    5879
3     인천                 전체  2015.0  10.0    3163
4     인천         전용면적 60㎡이하  2015.0  10.0    3488

In [25]:
df1 = df[['연도', '월']]
df1.shape

(4590, 2)

In [28]:
s = np.ones(df.shape[0])
s.shape

(4590,)

In [31]:
df1.head()

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [38]:
#칼럼씩 빼기
df1.sub(s, axis=0).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

출처: https://teddylee777.github.io/pandas/10minutes-to-pandas-%EB%B6%80%EB%8F%99%EC%82%B0%EC%8B%A4%EC%A0%9C%EB%8D%B0%EC%9D%B4%ED%84%B0-%ED%99%9C%EC%9A%A9%ED%95%98%EA%B8%B0

In [39]:
#index씩 빼기
s = np.ones(df1.shape[1])
df1.sub(s, axis=1).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

In [42]:
df1.apply(np.cumsum)[:10]

      연도    월
0   2015   10
1   4030   20
2   6045   30
3   8060   40
4  10075   50
5  12090   60
6  14105   70
7  16120   80
8  18135   90
9  20150  100

In [45]:
df1.apply(lambda x: x.max() - x.min())

연도     5
월     11
dtype: int64

In [50]:
df1['연도'].value_counts()

2019    1020
2018    1020
2017    1020
2016    1020
2015     255
2020     255
Name: 연도, dtype: int64

In [52]:
df['규모구분'].value_counts()

전용면적 85㎡초과 102㎡이하    918
전용면적 60㎡이하           918
전체                   918
전용면적 60㎡초과 85㎡이하     918
전용면적 102㎡초과          918
Name: 규모구분, dtype: int64